group1 = ["Попова", "Иванов", "Санникова", "Хайбулина", "Кузюкова", "Смирнов", "Фоминых", "Корнильева", "Ридер", "Еньшин"]
group2 = ["Лебедев", "Сергеев", "Морозов", "Ильин", "Тимофеев", "Захаров", "Романов", "Козлов", "Кириллов", "Ефимов"]
team = tuple(group1[:5] + group2[:5])
print("Группа 1:", group1)
print("Группа 2:", group2)
print("Спортивная команда:", team)
print("Длина списка:", len(team))
sort = tuple(sorted(team))
print("Отсортированная команда:", sort)
ivanov = team.count("Иванов")
if ivanov > 0:
    print(f"Студент 'Иванов' входит в команду {ivanov} раз")
else:
    print("Студент 'Иванов' не входит в команду.")
